from config import bot


@bot.message_handler(commands=['start'])
def start_message(message):
    sti = open('welcome.tgs', 'rb')
    bot.send_sticker(message.chat.id, sti)
    bot.send_message(message.chat.id,
                     'Добро пожаловать {0.first_name}!\nЯ - <b>{1.first_name}</b>, бот созданный чтобы '
                     'помочь тебе выбрать лучший отель для твоего отпуска!\nЯ помогу тебе освоиться, просто введи '
                     '"/help"'.format(message.from_user, bot.get_me()), parse_mode='html')


@bot.message_handler(commands=['help'])
def help_message(message):
    bot.send_message(message.chat.id,
                     'Я могу найти подходящий Вам отель в любом городе мира, за исключением городов России, Украины и '
                     'республики Беларусь.\nДля того чтобы начать выберите нужную команду (Вы можете их найти слева'
                     ' от строки ввода текста). Каждая комманда имеет краткое описание, так что трудностей возникнуть'
                     ' не должно! Но на всякий случай я коротко опишу мой функционал:\n\n- Могу найти бюджетный вариан,'
                     'чтобы Вам хотелось больше времени проводить на улицеи ибо это полезно;\n- Могу найти самые '
                     'дорогие варианты, ежели денег у Вас тьма, а так же есть пара идей в которые Вы могли бы вложить '
                     'деньги (пишите моему создателю);\n- Лучшее предложение, тут Вы сможете выбрать диапазон цен и '
                     'настроить расстояние до центра города, если Вам всё это Важно;\n- Так же можете посмотреть'
                     ' историю Ваших запросов;\n- И наконец есть команда для перезапуска поиска, если что-то пошло не'
                     ' по плану, но там куча проверок и такое должно случаться крайне редко, но тем не менее команда'
                     ' есть.\n- Приятного использования и если что не так, пишите @biglov_e')
